# Python in Pandas

In [193]:
import pandas as pd

In [173]:
df = pd.read_csv('weather.txt')

In [175]:
df

   month  avg_high  avg_low  record_high  record_low  avg_precipitation
0    Jan        58       42           74          22               2.95
1    Feb        61       45           78          26               3.02
2    Mar        65       48           84          25               2.34
3    Apr        67       50           92          28               1.02
4    May        71       53           98          35               0.48
5    Jun        75       56          107          41               0.11
6    Jul        77       58          105          44               0.00
7    Aug        77       59          102          43               0.03
8    Sep        77       57          103          40               0.17
9    Oct        73       54           96          34               0.81
10   Nov        64       48           84          30               1.70
11   Dec        58       42           73          21               2.56

#### The first 5 columns

In [28]:
df.head()

  month  avg_high  avg_low  record_high  record_low  avg_precipitation
0   Jan        58       42           74          22               2.95
1   Feb        61       45           78          26               3.02
2   Mar        65       48           84          25               2.34
3   Apr        67       50           92          28               1.02
4   May        71       53           98          35               0.48

#### The last 5 columns

In [30]:
df.tail()

   month  avg_high  avg_low  record_high  record_low  avg_precipitation
7    Aug        77       59          102          43               0.03
8    Sep        77       57          103          40               0.17
9    Oct        73       54           96          34               0.81
10   Nov        64       48           84          30               1.70
11   Dec        58       42           73          21               2.56

#### Data Types

In [32]:
df.dtypes

month                 object
avg_high               int64
avg_low                int64
record_high            int64
record_low             int64
avg_precipitation    float64
dtype: object

#### Describe

In [34]:
df.describe()

        avg_high    avg_low  record_high  record_low  avg_precipitation
count  12.000000  12.000000    12.000000   12.000000          12.000000
mean   68.583333  51.000000    91.333333   32.416667           1.265833
std     7.366488   6.060303    12.323911    8.240238           1.186396
min    58.000000  42.000000    73.000000   21.000000           0.000000
25%    63.250000  47.250000    82.500000   25.750000           0.155000
50%    69.000000  51.500000    94.000000   32.000000           0.915000
75%    75.500000  56.250000   102.250000   40.250000           2.395000
max    77.000000  59.000000   107.000000   44.000000           3.020000

#### Information for Data Frame such as (Column, Datatypes, Memory usage, ...)

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   month              12 non-null     object
 1   avg_high           12 non-null     int64
 2   avg_low            12 non-null     int64
 3   record_high        12 non-null     int64
 4   record_low         12 non-null     int64
 5   avg_precipitation  12 non-null     float64
dtypes: float64(1), int64(4), object(1)
memory usage: 708.0+ bytes

In [60]:
df['avg_low']
# df.avg_low

0     42
1     45
2     48
3     50
4     53
5     56
6     58
7     59
8     57
9     54
10    48
11    42
Name: avg_low, dtype: int64

In [64]:
x = df[['month','avg_precipitation']]

In [66]:
x

   month  avg_precipitation
0    Jan               2.95
1    Feb               3.02
2    Mar               2.34
3    Apr               1.02
4    May               0.48
5    Jun               0.11
6    Jul               0.00
7    Aug               0.03
8    Sep               0.17
9    Oct               0.81
10   Nov               1.70
11   Dec               2.56

#### Save new data frame

In [72]:
x.to_csv('New_weather.txt')

#### Change all name columns

In [ ]:
df.columns = ['A', 'B', 'C', 'H', 'D', 'F']

In [ ]:
df

#### change just some name columns

In [77]:
df.rename(columns={'avg_low': 'avgl', 'record_low': 'recordl'}, inplace=True)

In [79]:
df

   month  avg_high  avgl  record_high  recordl  avg_precipitation
0    Jan        58    42           74       22               2.95
1    Feb        61    45           78       26               3.02
2    Mar        65    48           84       25               2.34
3    Apr        67    50           92       28               1.02
4    May        71    53           98       35               0.48
5    Jun        75    56          107       41               0.11
6    Jul        77    58          105       44               0.00
7    Aug        77    59          102       43               0.03
8    Sep        77    57          103       40               0.17
9    Oct        73    54           96       34               0.81
10   Nov        64    48           84       30               1.70
11   Dec        58    42           73       21               2.56

#### Just show me some columns as I need

In [82]:
df = pd.read_csv('weather.txt', usecols=['month', 'avg_high', 'record_high'])

In [84]:
df

   month  avg_high  record_high
0    Jan        58           74
1    Feb        61           78
2    Mar        65           84
3    Apr        67           92
4    May        71           98
5    Jun        75          107
6    Jul        77          105
7    Aug        77          102
8    Sep        77          103
9    Oct        73           96
10   Nov        64           84
11   Dec        58           73

In [105]:
df['new_col'] = (df.avg_high+df.avg_low)/2

In [107]:
df

,month,avg_high,avg_low,record_high,record_low,avg_precipitation,new_col
0,Jan,58,42,74,22,2.95,50.0
1,Feb,61,45,78,26,3.02,53.0
2,Mar,65,48,84,25,2.34,56.5
3,Apr,67,50,92,28,1.02,58.5
4,May,71,53,98,35,0.48,62.0
5,Jun,75,56,107,41,0.11,65.5
6,Jul,77,58,105,44,0.00,67.5
7,Aug,77,59,102,43,0.03,68.0
8,Sep,77,57,103,40,0.17,67.0
9,Oct,73,54,96,34,0.81,63.5
10,Nov,64,48,84,30,1.70,56.0
11,Dec,58,42,73,21,2.56,50.0

In [109]:
df.rename(columns={'new_col': 'avg'}, inplace=True)

In [111]:
df

   month  avg_high  avg_low  record_high  record_low  avg_precipitation   avg
0    Jan        58       42           74          22               2.95  50.0
1    Feb        61       45           78          26               3.02  53.0
2    Mar        65       48           84          25               2.34  56.5
3    Apr        67       50           92          28               1.02  58.5
4    May        71       53           98          35               0.48  62.0
5    Jun        75       56          107          41               0.11  65.5
6    Jul        77       58          105          44               0.00  67.5
7    Aug        77       59          102          43               0.03  68.0
8    Sep        77       57          103          40               0.17  67.0
9    Oct        73       54           96          34               0.81  63.5
10   Nov        64       48           84          30               1.70  56.0
11   Dec        58       42           73          21               2.56  50.0

#### slicing

In [120]:
df.loc[4:8,['avg', 'month', 'avg_low']]

    avg month  avg_low
4  62.0   May       53
5  65.5   Jun       56
6  67.5   Jul       58
7  68.0   Aug       59
8  67.0   Sep       57

#### index location

In [125]:
df.iloc[4:9,[6,0,2]]

    avg month  avg_low
4  62.0   May       53
5  65.5   Jun       56
6  67.5   Jul       58
7  68.0   Aug       59
8  67.0   Sep       57

#### Just line average precipitation bigger than 1

In [128]:
df[df.avg_precipitation>1]

   month  avg_high  avg_low  record_high  record_low  avg_precipitation   avg
0    Jan        58       42           74          22               2.95  50.0
1    Feb        61       45           78          26               3.02  53.0
2    Mar        65       48           84          25               2.34  56.5
3    Apr        67       50           92          28               1.02  58.5
10   Nov        64       48           84          30               1.70  56.0
11   Dec        58       42           73          21               2.56  50.0

#### logical Condition: For example I need just line (feb, July and Novomeber)

In [135]:
df[df['month'].isin(['Feb','Jul','Nov'])]

   month  avg_high  avg_low  record_high  record_low  avg_precipitation   avg
1    Feb        61       45           78          26               3.02  53.0
6    Jul        77       58          105          44               0.00  67.5
10   Nov        64       48           84          30               1.70  56.0

### Save under the new df

In [177]:
new_df = df[df.avg_precipitation>1]

In [195]:
new_df

   month  avg_high  avg_low  record_high  record_low  avg_precipitation
0    Jan        58       42           74          22               2.95
1    Feb        61       45           78          26               3.02
2    Mar        65       48           84          25               2.34
3    Apr        67       50           92          28               1.02
10   Nov        64       48           84          30               1.70
11   Dec        58       42           73          21               2.56

In [197]:
new_df.to_csv('new_df.csv')

In [183]:
df = pd.read_csv('new_df.csv')

In [205]:
df.to_csv('new_df.csv' , index=False)